RunningChild/efm32_freertos_app/src/bsp/common/emdrv/uartdrv/src/uartdrv.c
/***************************************************************************//**
 * @file uartdrv.c
 * @brief UARTDRV API implementation.
 * @version 4.4.0
 *******************************************************************************
 * @section License
 * <b>Copyright 2016 Silicon Laboratories, Inc, http://www.silabs.com</b>
 *******************************************************************************
 *
 * This file is licensed under the Silabs License Agreement. See the file
 * "Silabs_License_Agreement.txt" for details. Before using this software for
 * any purpose, you must agree to the terms of that agreement.
 *
 ******************************************************************************/
#include <string.h>

#include "em_device.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_int.h"
#include "em_usart.h"
#include "uartdrv.h"

#include "log.h"

#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
#include "gpiointerrupt.h"
#endif

#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE) && defined(_USART_ROUTEPEN_CTSPEN_MASK)
#define UART_HW_FLOW_CONTROL_SUPPORT
#endif

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
static bool uartdrvHandleIsInitialized = false;
static UARTDRV_Handle_t uartdrvHandle[EMDRV_UARTDRV_MAX_DRIVER_INSTANCES];
#endif

static bool ReceiveDmaComplete(unsigned int channel,
                               unsigned int sequenceNo,
                               void *userParam);
static bool TransmitDmaComplete(unsigned int channel,
                                unsigned int sequenceNo,
                                void *userParam);

/***************************************************************************//**
 * @brief Get UARTDRV_Handle_t from GPIO pin number (HW FC CTS pin interrupt)
 ******************************************************************************/
#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
static UARTDRV_Handle_t HwFcCtsIrqGetDrvHandle(uint32_t gpioPinNo)
{
  uint32_t i;

  for (i = 0; i < EMDRV_UARTDRV_MAX_DRIVER_INSTANCES; i++)
  {
    if (uartdrvHandle[i]->ctsPin == gpioPinNo)
    {
      return uartdrvHandle[i];
    }
  }
  return NULL;
}

/***************************************************************************//**
 * @brief Get CTS pin state
 ******************************************************************************/
static UARTDRV_FlowControlState_t HwFcGetClearToSendPin(UARTDRV_Handle_t handle)
{
  if (handle->fcType == uartdrvFlowControlHw)
  {
    return (UARTDRV_FlowControlState_t)GPIO_PinInGet(handle->ctsPort, handle->ctsPin);
  }
  else
  {
    return uartdrvFlowControlOn;
  }
}

/***************************************************************************//**
 * @brief Manage CTS pin change
 ******************************************************************************/
static void HwFcManageClearToSend(uint8_t gpioPinNo)
{
  UARTDRV_Handle_t handle = HwFcCtsIrqGetDrvHandle(gpioPinNo);

  if (handle && handle->fcType == uartdrvFlowControlHw)
  {
    // If not auto mode, just assign the CTS pin state to the self state
    // If auto mode, also control UART TX enable
    handle->fcSelfState = HwFcGetClearToSendPin(handle);
    if (handle->fcSelfCfg == uartdrvFlowControlAuto)
    {
      // Only manage DMA if transfer is active and not already paused by SW
      bool active = false;
      Ecode_t status = DMADRV_TransferActive( handle->txDmaCh , &active );
      if ( (status == ECODE_EMDRV_DMADRV_OK) && active && handle->txDmaPaused == 0)
      {
        if ((handle->fcSelfState == uartdrvFlowControlOn) || handle->IgnoreRestrain)
        {
          handle->IgnoreRestrain = false;
          DMADRV_ResumeTransfer(handle->txDmaCh);
        }
        else
        {
          DMADRV_PauseTransfer(handle->txDmaCh);
        }
      }
    }
  }
}

static Ecode_t FcApplyState(UARTDRV_Handle_t handle)
{
  uint8_t fcSwCode;

  if (handle->fcType == uartdrvFlowControlHw)
  {
    if (handle->fcSelfCfg == uartdrvFlowControlOn)
    {
      // Assert nRTS (application control)
      GPIO_PinOutClear(handle->rtsPort, handle->rtsPin);
    }
    else if (handle->fcSelfCfg == uartdrvFlowControlOff)
    {
      // Deassert nRTS (application control)
      GPIO_PinOutSet(handle->rtsPort, handle->rtsPin);
    }
    else // Auto mode
    {
      if (handle->fcSelfState == uartdrvFlowControlOn)
      {
        // Assert nRTS
        GPIO_PinOutClear(handle->rtsPort, handle->rtsPin);
      }
      else // Off
      {
        // Deassert nRTS
        GPIO_PinOutSet(handle->rtsPort, handle->rtsPin);
      }
    }
  }
  else if (handle->fcType == uartdrvFlowControlSw)
  {
    if (handle->fcSelfState == uartdrvFlowControlOn)
    {
      fcSwCode = UARTDRV_FC_SW_XON;
      // Pause transmit to ensure XON transmits immediately
      UARTDRV_PauseTransmit(handle);
      UARTDRV_ForceTransmit(handle, &fcSwCode, 1);
      UARTDRV_ResumeTransmit(handle);
    }
    else
    {
      fcSwCode = UARTDRV_FC_SW_XOFF;
      // Pause transmit to ensure XOFF transmits immediately
      UARTDRV_PauseTransmit(handle);
      UARTDRV_ForceTransmit(handle, &fcSwCode, 1);
      UARTDRV_ResumeTransmit(handle);
    }
  }
  return ECODE_EMDRV_UARTDRV_OK;
}
#else
// CTS pin should always read as uartdrvFlowControlOn when HW FC is disabled
#define HwFcGetClearToSendPin(x) uartdrvFlowControlOn
#endif /* EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE */

/***************************************************************************//**
 * @brief Enqueue UART transfer buffer
 ******************************************************************************/
static Ecode_t EnqueueBuffer(UARTDRV_Buffer_FifoQueue_t *queue,
                             UARTDRV_Buffer_t *inputBuffer,
                             UARTDRV_Buffer_t **queueBuffer)
{
  INT_Disable();
  if (queue->used >= queue->size)
  {
    *queueBuffer = NULL;
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_QUEUE_FULL;
  }
  memcpy((void *)&queue->fifo[queue->head],
         (const void *)inputBuffer,
         sizeof(UARTDRV_Buffer_t));
  *queueBuffer = &queue->fifo[queue->head];
  queue->head = (queue->head + 1) % queue->size;
  queue->used++;
  INT_Enable();

  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief Dequeue UART transfer buffer
 ******************************************************************************/
static Ecode_t DequeueBuffer(UARTDRV_Buffer_FifoQueue_t *queue,
                             UARTDRV_Buffer_t **buffer)
{
  INT_Disable();
  if (queue->used == 0)
  {
    *buffer = NULL;
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_QUEUE_EMPTY;
  }
  *buffer = &queue->fifo[queue->tail];
  queue->tail = (queue->tail + 1) % queue->size;
  queue->used--;
  INT_Enable();

  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief Get tail UART transfer buffer
 ******************************************************************************/
static Ecode_t GetTailBuffer(UARTDRV_Buffer_FifoQueue_t *queue,
                             UARTDRV_Buffer_t **buffer)
{
  INT_Disable();
  if (queue->used == 0)
  {
    *buffer = NULL;
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_QUEUE_EMPTY;
  }
  *buffer = &queue->fifo[queue->tail];

  INT_Enable();
  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief Enable UART transmitter
 ******************************************************************************/
static void EnableTransmitter(UARTDRV_Handle_t handle)
{
  if (handle->type == uartdrvUartTypeUart)
  {
    handle->peripheral.uart->CMD = USART_CMD_TXEN;
    // Wait for TX to be enabled
    while (!(handle->peripheral.uart->STATUS & USART_STATUS_TXENS));
#if defined(USART_ROUTEPEN_TXPEN)
    handle->peripheral.uart->ROUTEPEN |= USART_ROUTEPEN_TXPEN;
#else
    handle->peripheral.uart->ROUTE |= USART_ROUTE_TXPEN;
#endif
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    handle->peripheral.leuart->CMD = LEUART_CMD_TXEN;
    // Wait for TX to be enabled
    while (!(handle->peripheral.leuart->STATUS & LEUART_STATUS_TXENS));
#if defined(LEUART_ROUTEPEN_TXPEN)
    handle->peripheral.leuart->ROUTEPEN |= LEUART_ROUTEPEN_TXPEN;
#else
    handle->peripheral.leuart->ROUTE |= LEUART_ROUTE_TXPEN;
#endif
  }
}

/***************************************************************************//**
 * @brief Disable UART transmitter
 ******************************************************************************/
static void DisableTransmitter(UARTDRV_Handle_t handle)
{
  if (handle->type == uartdrvUartTypeUart)
  {
#if defined(USART_ROUTEPEN_TXPEN)
    handle->peripheral.uart->ROUTEPEN &= ~USART_ROUTEPEN_TXPEN;
#else
    handle->peripheral.uart->ROUTE &= ~USART_ROUTE_TXPEN;
#endif
    handle->peripheral.uart->CMD = USART_CMD_TXDIS;
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
#if defined(LEUART_ROUTEPEN_TXPEN)
    handle->peripheral.leuart->ROUTEPEN &= ~LEUART_ROUTEPEN_TXPEN;
#else
    handle->peripheral.leuart->ROUTE &= ~LEUART_ROUTE_TXPEN;
#endif
    handle->peripheral.leuart->CMD = LEUART_CMD_TXDIS;

    //_by_pbh add leuart用低频时钟时，需要考虑低频域同步问题
    // Wait for TX to be disabled
    while (handle->peripheral.leuart->STATUS & LEUART_STATUS_TXENS);
  }
}

/***************************************************************************//**
 * @brief Enable UART receiver
 ******************************************************************************/
static void EnableReceiver(UARTDRV_Handle_t handle)
{
  if (handle->type == uartdrvUartTypeUart)
  {
    handle->peripheral.uart->CMD = USART_CMD_RXEN;
    // Wait for RX to be enabled
    while (!(handle->peripheral.uart->STATUS & USART_STATUS_RXENS));
#if defined(USART_ROUTEPEN_RXPEN)
    handle->peripheral.uart->ROUTEPEN |= USART_ROUTEPEN_RXPEN;
#else
    handle->peripheral.uart->ROUTE |= USART_ROUTE_RXPEN;
#endif
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    handle->peripheral.leuart->CMD = LEUART_CMD_RXEN;
    // Wait for RX to be enabled
    while (!(handle->peripheral.leuart->STATUS & USART_STATUS_RXENS));
#if defined(USART_ROUTEPEN_RXPEN)
    handle->peripheral.leuart->ROUTEPEN |= USART_ROUTEPEN_RXPEN;
#else
    handle->peripheral.leuart->ROUTE |= USART_ROUTE_RXPEN;
#endif
  }
}

/***************************************************************************//**
 * @brief Disable UART receiver
 ******************************************************************************/
static void DisableReceiver(UARTDRV_Handle_t handle)
{
  if (handle->type == uartdrvUartTypeUart)
  {
#if defined(USART_ROUTEPEN_RXPEN)
    handle->peripheral.uart->ROUTEPEN &= ~USART_ROUTEPEN_RXPEN;
#else
    handle->peripheral.uart->ROUTE &= ~USART_ROUTE_RXPEN;
#endif
    handle->peripheral.uart->CMD = USART_CMD_RXDIS;
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
#if defined(LEUART_ROUTEPEN_RXPEN)
    handle->peripheral.leuart->ROUTEPEN &= ~LEUART_ROUTEPEN_RXPEN;
#else
    handle->peripheral.leuart->ROUTE &= ~LEUART_ROUTE_RXPEN;
#endif
    handle->peripheral.leuart->CMD = LEUART_CMD_RXDIS;
  }
}

/***************************************************************************//**
 * @brief Start a UART DMA receive operation.
 ******************************************************************************/
static void StartReceiveDma(UARTDRV_Handle_t handle,
                            UARTDRV_Buffer_t *buffer)
{
  void *rxPort = NULL;

  handle->rxDmaActive = true;
  if (handle->type == uartdrvUartTypeUart)
  {
    rxPort = (void *)&(handle->peripheral.uart->RXDATA);
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    rxPort = (void *)&(handle->peripheral.leuart->RXDATA);
  }
  else
  {
    handle->rxDmaActive = false;
    return;
  }

  DMADRV_PeripheralMemory(handle->rxDmaCh,
                          handle->rxDmaSignal,
                          buffer->data,
                          rxPort,
                          true,
                          buffer->transferCount,
                          dmadrvDataSize1,
                          ReceiveDmaComplete,
                          handle);
}

/***************************************************************************//**
 * @brief Start a UART DMA transmit operation.
 ******************************************************************************/
static void StartTransmitDma(UARTDRV_Handle_t handle,
                             UARTDRV_Buffer_t *buffer)
{
  void *txPort = NULL;

