RunningChild/efm32_freertos_app/src/bsp/common/emdrv/uartdrv/src/uartdrv.c
    // If we ran out of stretch on the clock division, error out.
    if (divisor > _CMU_LFBPRESC0_MASK)
    {
      return ECODE_EMDRV_UARTDRV_CLOCK_ERROR;
    }

    CMU_ClockDivSet(handle->uartClock, (CMU_ClkDiv_TypeDef) (1 << divisor));
  }

  CMU_ClockEnable(handle->uartClock, true);

  // Init LEUART to default async config.
  // RX/TX enable is done on demand
  leuartInit.enable = leuartDisable;
  LEUART_Init(initData->port, &leuartInit);

#if defined(LEUART_ROUTEPEN_TXPEN)
  initData->port->ROUTEPEN = LEUART_ROUTEPEN_TXPEN
                             | LEUART_ROUTEPEN_RXPEN;
  initData->port->ROUTELOC0 = (initData->port->ROUTELOC0
                               & ~(_LEUART_ROUTELOC0_TXLOC_MASK
                                   | _LEUART_ROUTELOC0_RXLOC_MASK))
                              | (initData->portLocationTx
                                 << _LEUART_ROUTELOC0_TXLOC_SHIFT)
                              | (initData->portLocationRx
                                 << _LEUART_ROUTELOC0_RXLOC_SHIFT);
#else
  initData->port->ROUTE = LEUART_ROUTE_TXPEN
                          | LEUART_ROUTE_RXPEN
                          | (initData->portLocation
                             << _LEUART_ROUTE_LOCATION_SHIFT);
#endif

  if ((retVal = SetupGpioLeuart(handle, initData)) != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  if ((retVal = ConfigGpio(handle, true)) != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }

  INT_Disable();

  // Configure hardware flow control pins and interrupt vectors
#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
  if (initData->fcType == uartdrvFlowControlHw)
  {
    InitializeGpioFlowControl(handle);
  }
#endif

  // Clear any false IRQ/DMA request
  LEUART_IntClear(initData->port, ~0x0);

  // Enable TX permanently as the TX circuit consumes very little energy.
  // RX is enabled on demand as the RX circuit consumes some energy due to
  // continuous (over)sampling.
  LEUART_Enable(initData->port, leuartEnableTx);

  // Discard false frames and/or IRQs
  initData->port->CMD = LEUART_CMD_CLEARRX | LEUART_CMD_CLEARTX;

  // Initialize DMA.
  DMADRV_Init();

  retVal = InitializeDma(handle);

/*当MCU工作在EM2模式时，为了执行DMA传送，必须将DMA控制器上电。
对于读操作，如果LEUARTn_CTRL中的RXDMAWU被置位，则上电过程是自动完成的；
对于写操作，如果LEUARTn_CTRL中的TXDMAWU被置位，该上电过程也是自动完成的。
为确保DMA控制器在低能耗模式仍能与LEUART进行数据传送，必须正确配置这些位。
在EM2模式，DMA使用HFRCO运行，所以该高频振荡器也被自动唤醒和关断。
在使用DMA处理LEUART之前，还必须正确使能和配置DMA。 */
#if 1//_by_pbh
  LEUART_TxDmaInEM2Enable(handle->peripheral.leuart, true);
  LEUART_RxDmaInEM2Enable(handle->peripheral.leuart, true);

  LEUART_TxDelayEnable(handle->peripheral.leuart, true);
#endif

  INT_Enable();

  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }

  return ECODE_EMDRV_UARTDRV_OK;
}


/***************************************************************************//**
 * @brief
 *    Deinitialize a UART driver instance.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success. On failure an appropriate
 *    UARTDRV @ref Ecode_t is returned.
 ******************************************************************************/
Ecode_t UARTDRV_DeInit(UARTDRV_Handle_t handle)
{
  if (handle == NULL)
  {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_HANDLE;
  }
  // Stop DMA transfers.
  DMADRV_StopTransfer(handle->rxDmaCh);
  DMADRV_StopTransfer(handle->txDmaCh);

  // Do not leave any peer restrained on DeInit
  UARTDRV_FlowControlSet(handle, uartdrvFlowControlOn);

  ConfigGpio(handle, false);
  if (handle->type == uartdrvUartTypeUart)
  {
    handle->peripheral.uart->CMD = USART_CMD_RXDIS;
    handle->peripheral.uart->CMD = USART_CMD_TXDIS;
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    LEUART_Reset(handle->peripheral.leuart);
    handle->peripheral.leuart->CMD = LEUART_CMD_RXDIS;
    handle->peripheral.leuart->CMD = LEUART_CMD_TXDIS;
  }

  CMU_ClockEnable(handle->uartClock, false);

#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
  if (handle->fcType != uartdrvFlowControlHwUart)
  {
    GPIOINT_CallbackRegister(handle->ctsPin, NULL);
  }
#endif

  DMADRV_FreeChannel(handle->txDmaCh);
  DMADRV_FreeChannel(handle->rxDmaCh);
//  LOG(LEVEL_DEBUG, "free txDmaCh=%d, rxDmaCh=%d", handle->txDmaCh, handle->rxDmaCh);
//  DMADRV_DeInit();//_by_pbh add

  handle->rxQueue->head = 0;
  handle->rxQueue->tail = 0;
  handle->rxQueue->used = 0;

  handle->txQueue->head = 0;
  handle->txQueue->tail = 0;
  handle->txQueue->used = 0;

  return ECODE_EMDRV_UARTDRV_OK;
}


/***************************************************************************//**
 * @brief
 *    Abort an ongoing UART transfer.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] type Abort type
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success, @ref ECODE_EMDRV_UARTDRV_IDLE if
 *    the UART is idle. On failure an appropriate UARTDRV @ref Ecode_t is returned.
 ******************************************************************************/
Ecode_t UARTDRV_Abort(UARTDRV_Handle_t handle, UARTDRV_AbortType_t type)
{
  UARTDRV_Buffer_t *rxBuffer, *txBuffer;

  if (handle == NULL) {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_HANDLE;
  }

  INT_Disable();
  if ((type == uartdrvAbortTransmit) && (handle->txQueue->used == 0))
  {
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_IDLE;
  }
  else if ((type == uartdrvAbortReceive) && (handle->rxQueue->used == 0))
  {
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_IDLE;
  }
  else if ((type == uartdrvAbortAll)
           && (handle->txQueue->used == 0)
           && (handle->rxQueue->used == 0))
  {
    INT_Enable();
    return ECODE_EMDRV_UARTDRV_IDLE;
  }

  // Stop DMA transfers.
  if ((type == uartdrvAbortTransmit) || (type == uartdrvAbortAll))
  {
    GetTailBuffer(handle->txQueue, &txBuffer);
    DMADRV_StopTransfer(handle->txDmaCh);
    DMADRV_TransferRemainingCount(handle->txDmaCh,
                                  (int*)&txBuffer->itemsRemaining);
    txBuffer->transferStatus = ECODE_EMDRV_UARTDRV_ABORTED;
    if (txBuffer->callback != NULL)
    {
      txBuffer->callback(handle,
                         ECODE_EMDRV_UARTDRV_ABORTED,
                         NULL,
                         txBuffer->itemsRemaining);
    }
  }
  if ((type == uartdrvAbortReceive) || (type == uartdrvAbortAll))
  {
    GetTailBuffer(handle->rxQueue, &rxBuffer);
    DMADRV_StopTransfer(handle->rxDmaCh);
    DMADRV_TransferRemainingCount(handle->rxDmaCh,
                                  (int*)&rxBuffer->itemsRemaining);
    rxBuffer->transferStatus = ECODE_EMDRV_UARTDRV_ABORTED;
    if (rxBuffer->callback != NULL)
    {
      rxBuffer->callback(handle,
                         ECODE_EMDRV_UARTDRV_ABORTED,
                         NULL,
                         rxBuffer->itemsRemaining);
    }
  }
  INT_Enable();

  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Returns the status of the UART peripheral associated with a given handle.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @return
 *    UART status value
 ******************************************************************************/
UARTDRV_Status_t UARTDRV_GetPeripheralStatus(UARTDRV_Handle_t handle)
{
  UARTDRV_Status_t status = 0;

  if (handle->type == uartdrvUartTypeUart)
  {
    status = handle->peripheral.uart->STATUS;
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    uint32_t reg = handle->peripheral.leuart->STATUS;
    if (reg & LEUART_STATUS_TXENS)
    {
      status |= UARTDRV_STATUS_TXEN;
    }
    if (reg & LEUART_STATUS_RXENS)
    {
      status |= UARTDRV_STATUS_RXEN;
    }
    if (reg & LEUART_STATUS_RXBLOCK)
    {
      status |= UARTDRV_STATUS_RXBLOCK;
    }
    if (reg & LEUART_STATUS_TXC)
    {
      status |= UARTDRV_STATUS_TXC;
    }
    if (reg & LEUART_STATUS_TXBL)
    {
      status |= UARTDRV_STATUS_TXBL;
    }
    if (reg & LEUART_STATUS_RXDATAV)
    {
      status |= UARTDRV_STATUS_RXDATAV;
    }
#if defined(LEUART_STATUS_TXIDLE)
    if (reg & LEUART_STATUS_TXIDLE)
    {
      status |= UARTDRV_STATUS_TXIDLE;
    }
#endif
  }

#if defined(_SILICON_LABS_32B_PLATFORM_1)
  // Platform 1 does not have the TXIDLE flag, so we emulate it
  if ((status & UARTDRV_STATUS_TXC) || !(handle->hasTransmitted))
  {
    status |= UARTDRV_STATUS_TXIDLE;
  }
#endif

