RunningChild/efm32_freertos_app/src/bsp/common/emdrv/uartdrv/src/uartdrv.c
  if (!rxState)
  {
    DisableReceiver(handle);
  }
  return i;
}


/***************************************************************************//**
 * @brief
 *    Direct transmit without interrupts or callback. Blocking function
 *    that ignores flow control if enabled.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] data Pointer to buffer.
 *
 * @param[in] count Number of bytes to transmit.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success.
 ******************************************************************************/
Ecode_t  UARTDRV_ForceTransmit(UARTDRV_Handle_t handle,
                               uint8_t *data,
                               UARTDRV_Count_t count)
{
  Ecode_t retVal;
  uint32_t txState;

  retVal = CheckParams(handle, data, count);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }

  // Wait for DMA transmit to complete and clear
  while((handle->txQueue->used > 0) && (!handle->txDmaPaused));

  if (handle->type == uartdrvUartTypeUart)
  {
    txState = (handle->peripheral.uart->STATUS & USART_STATUS_TXENS);
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    txState = (handle->peripheral.leuart->STATUS & LEUART_STATUS_TXENS);
  }
  else
  {
    EFM_ASSERT(false);
    txState = 0;
  }
  if (!txState)
  {
    EnableTransmitter(handle);
  }

  handle->hasTransmitted = true;

  if (handle->type == uartdrvUartTypeUart)
  {
    while (count--)
    {
      // Wait for space in TX buffer
      while (!(handle->peripheral.uart->STATUS & USART_STATUS_TXBL));
      handle->peripheral.uart->TXDATA = *data;
      data++;
    }
    // Wait for TX completion
    while (!(handle->peripheral.uart->STATUS & USART_STATUS_TXC))
    {
    }
  }
  else if (handle->type == uartdrvUartTypeLeuart)
  {
    while (count--)
    {
      // Wait for space in TX buffer
      while (!(handle->peripheral.leuart->STATUS & LEUART_STATUS_TXBL));
      handle->peripheral.leuart->TXDATA = *data;
      data++;
    }
    // Wait for TX completion
    while (!(handle->peripheral.leuart->STATUS & LEUART_STATUS_TXC));
  }

  if (!txState)
  {
    DisableTransmitter(handle);
  }

  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief
 *  Pause an ongoing transmit operation.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @return
 *  @ref ECODE_EMDRV_UARTDRV_OK on success. On failure an appropriate
 *  UARTDRV @ref Ecode_t is returned.
 ******************************************************************************/
Ecode_t UARTDRV_PauseTransmit(UARTDRV_Handle_t handle)
{
  if (handle == NULL)
  {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_HANDLE;
  }
  bool active = false;
  // An active DMA transfer signifies that the channel is in use
  Ecode_t status = DMADRV_TransferActive( handle->txDmaCh , &active );
  if ( (status == ECODE_EMDRV_DMADRV_OK) && active )
  {
    // Pause the transfer if 1) pause counter is 0
    //                       2) HW flow control hasn't already paused the DMA
    if ( (handle->txDmaPaused == 0) && (HwFcGetClearToSendPin(handle) == uartdrvFlowControlOn) )
    {
      DMADRV_PauseTransfer(handle->txDmaCh);
    }
    // Increment counter to allow nested calls
    handle->txDmaPaused++;
  }
  else
  {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_OPERATION;
  }
  return ECODE_EMDRV_UARTDRV_OK;
}


/***************************************************************************//**
 * @brief
 *    Start a non-blocking receive.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] data Receive data buffer.
 *
 * @param[in] count Number of bytes received.
 *
 * @param[in]  callback Transfer completion callback.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success.
 ******************************************************************************/
Ecode_t UARTDRV_Receive(UARTDRV_Handle_t handle,
                        uint8_t *data,
                        UARTDRV_Count_t count,
                        UARTDRV_Callback_t callback)
{
  Ecode_t retVal;
  UARTDRV_Buffer_t outputBuffer;
  UARTDRV_Buffer_t *queueBuffer;

  retVal = CheckParams(handle, data, count);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  outputBuffer.data = data;
  outputBuffer.transferCount = count;
  outputBuffer.itemsRemaining = count;
  outputBuffer.callback = callback;
  outputBuffer.transferStatus = ECODE_EMDRV_UARTDRV_WAITING;

  retVal = EnqueueBuffer(handle->rxQueue, &outputBuffer, &queueBuffer);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
//    LOG(LEVEL_FORCE, "[UARTDRV_Receive] rxQueue full.");
    return retVal;
  }
  if (!(handle->rxDmaActive))
  {
    StartReceiveDma(handle, queueBuffer);
    EnableReceiver(handle);//_by_pbh 防止上电立即接收到数据导致异常
#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
    if (handle->fcType != uartdrvFlowControlHwUart)
    {
      handle->fcSelfState = uartdrvFlowControlOn;
      FcApplyState(handle);
    }
#endif
  } // else: started by ReceiveDmaComplete

  return ECODE_EMDRV_UARTDRV_OK;
}


/***************************************************************************//**
 * @brief
 *    Start a blocking receive.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] data Receive data buffer.
 *
 * @param[in] count Number of bytes received.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success.
 ******************************************************************************/
Ecode_t UARTDRV_ReceiveB(UARTDRV_Handle_t handle,
                         uint8_t *data,
                         UARTDRV_Count_t count)
{
  Ecode_t retVal;
  UARTDRV_Buffer_t inputBuffer;
  UARTDRV_Buffer_t *queueBuffer;

  retVal = CheckParams(handle, data, count);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  inputBuffer.data = data;
  inputBuffer.transferCount = count;
  inputBuffer.itemsRemaining = count;
  inputBuffer.callback = NULL;
  inputBuffer.transferStatus = ECODE_EMDRV_UARTDRV_WAITING;

  retVal = EnqueueBuffer(handle->rxQueue, &inputBuffer, &queueBuffer);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  while (handle->rxQueue->used > 1)
  {
    EMU_EnterEM1();
  }
  EnableReceiver(handle);
#if (EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE)
  if (handle->fcType != uartdrvFlowControlHwUart)
  {
    handle->fcSelfState = uartdrvFlowControlOn;
    FcApplyState(handle);
  }
#endif
  StartReceiveDma(handle, queueBuffer);
  while (handle->rxDmaActive)
  {
    EMU_EnterEM1();
  }
  return queueBuffer->transferStatus;
}

/***************************************************************************//**
 * @brief
 *  Resume a paused transmit operation.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @return
 *  @ref ECODE_EMDRV_UARTDRV_OK on success. On failure an appropriate
 *  UARTDRV @ref Ecode_t is returned.
 ******************************************************************************/
Ecode_t UARTDRV_ResumeTransmit(UARTDRV_Handle_t handle)
{
  if (handle == NULL)
  {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_HANDLE;
  }
  bool active = false;
  Ecode_t status = DMADRV_TransferActive( handle->txDmaCh , &active );
  if ( (status == ECODE_EMDRV_DMADRV_OK) && (handle->txDmaPaused > 0) && active )
  {
    // Resume the transfer if 1) pause counter is 1
    //                        2) HW flow control doesn't need to pause the DMA
    if ( (handle->txDmaPaused == 1) && (HwFcGetClearToSendPin(handle) == uartdrvFlowControlOn) )
    {
      DMADRV_ResumeTransfer(handle->txDmaCh);
    }
    handle->txDmaPaused--;
  }
  else
  {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_OPERATION;
  }
  return ECODE_EMDRV_UARTDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Start a non-blocking transmit.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] data Transmit data buffer.
 *
 * @param[in] count Number of bytes to transmit.
 *
 * @param[in]  callback Transfer completion callback.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success.
 ******************************************************************************/
Ecode_t UARTDRV_Transmit(UARTDRV_Handle_t handle,
                         uint8_t *data,
                         UARTDRV_Count_t count,
                         UARTDRV_Callback_t callback)
{
  Ecode_t retVal;
  UARTDRV_Buffer_t inputBuffer;
  UARTDRV_Buffer_t *queueBuffer;

  retVal = CheckParams(handle, data, count);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  inputBuffer.data = data;
  inputBuffer.transferCount = count;
  inputBuffer.itemsRemaining = count;
  inputBuffer.callback = callback;
  inputBuffer.transferStatus = ECODE_EMDRV_UARTDRV_WAITING;

  retVal = EnqueueBuffer(handle->txQueue, &inputBuffer, &queueBuffer);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  if (!(handle->txDmaActive))
  {
    INT_Disable();
    if (handle->txQueue->used > 0)
    {
      StartTransmitDma(handle, queueBuffer);
      handle->hasTransmitted = true;
    }
    INT_Enable();
  } // else: started by TransmitDmaComplete

  return ECODE_EMDRV_UARTDRV_OK;
}


/***************************************************************************//**
 * @brief
 *    Start a blocking transmit.
 *
 * @param[in] handle Pointer to a UART driver handle.
 *
 * @param[in] data Transmit data buffer.
 *
 * @param[in] count Number of bytes to transmit.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success.
 ******************************************************************************/
Ecode_t UARTDRV_TransmitB(UARTDRV_Handle_t handle,
                          uint8_t *data,
                          UARTDRV_Count_t count)
{
  Ecode_t retVal;
  UARTDRV_Buffer_t outputBuffer;
  UARTDRV_Buffer_t *queueBuffer;

  retVal = CheckParams(handle, data, count);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  outputBuffer.data = data;
  outputBuffer.transferCount = count;
  outputBuffer.itemsRemaining = count;
  outputBuffer.callback = NULL;
  outputBuffer.transferStatus = ECODE_EMDRV_UARTDRV_WAITING;

  retVal = EnqueueBuffer(handle->txQueue, &outputBuffer, &queueBuffer);
  if (retVal != ECODE_EMDRV_UARTDRV_OK)
  {
    return retVal;
  }
  while (handle->txQueue->used > 1)
  {
    EMU_EnterEM1();
  }
  StartTransmitDma(handle, queueBuffer);
  handle->hasTransmitted = true;
  while (handle->txDmaActive)
  {
    EMU_EnterEM1();
  }
  return queueBuffer->transferStatus;
}

/***************************************************************************//**
 * @brief uartdrv_get_transfered_len
 ******************************************************************************/
bool uartdrv_get_transfered_len(UARTDRV_Handle_t handle)
{
    UARTDRV_Buffer_t *rxBuffer;

    if (handle == NULL) {
        return false;
    }

