RunningChild/efm32_freertos_app/src/bsp/common/emdrv/uartdrv/src/uartdrv.c
    INT_Disable();

    GetTailBuffer(handle->rxQueue, &rxBuffer);
    DMADRV_StopTransfer(handle->rxDmaCh);
    DMADRV_TransferRemainingCount(handle->rxDmaCh,
                                  (int*)&rxBuffer->itemsRemaining);

    rxBuffer->transferStatus = ECODE_EMDRV_UARTDRV_ABORTED;

    if (rxBuffer->callback != NULL)
    {
      rxBuffer->callback(handle,
                         rxBuffer->transferStatus,
                         rxBuffer->data,
                         rxBuffer->transferCount - rxBuffer->itemsRemaining);
    }

    // Dequeue the current tail RX operation, check if more in queue
    DequeueBuffer(handle->rxQueue, &rxBuffer);

    if (handle->rxQueue->used > 0)
    {
        GetTailBuffer(handle->rxQueue, &rxBuffer);
        StartReceiveDma(handle, rxBuffer);
    }
    else
    {
#if EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE
        handle->fcSelfState = uartdrvFlowControlOff;
        FcApplyState(handle);
#endif
        handle->rxDmaActive = false;

        if (handle->fcType != uartdrvFlowControlHwUart)
        {
          DisableReceiver(handle);
        }
    }

    //重新使能
    DMA_ChannelEnable(handle->rxDmaCh, true);

    INT_Enable();

    return true;
}

/***************************************************************************//**
 * @brief uartdrv_rx_channel_enable
 ******************************************************************************/
bool uartdrv_rx_channel_enable(UARTDRV_Handle_t handle, bool enable)
{
    if (NULL == handle)
    {
        return false;
    }

    DMA_ChannelEnable(handle->rxDmaCh, enable);

    if(false == enable)
    {
        uint32_t itemsRemaining;
        DMADRV_TransferRemainingCount(handle->rxDmaCh, (int*)(&itemsRemaining));
    }

    return true;
}

/******** THE REST OF THE FILE IS DOCUMENTATION ONLY !**********************//**
 * @addtogroup emdrv
 * @{
 * @addtogroup UARTDRV
 * @{

@details
  The source files for the UART driver library resides in the
  emdrv/uartdrv folder, and are named uartdrv.c and uartdrv.h.

  @li @ref uartdrv_intro
  @li @ref uartdrv_conf
  @li @ref uartdrv_api
  @li @ref uartdrv_fc
  @li @ref uartdrv_example

@n @section uartdrv_intro Introduction
  The UART driver support the UART capabilities of the USART, UART and LEUART
  peripherals. The driver is fully reentrant and multiple driver instances can
  coexist. The driver does not buffer or queue data, but it queues UART transmit
  and receive operations. Both blocking and non-blocking transfer functions are
  available. Non-blocking transfer functions report transfer completion with
  callback functions. Transfers are done using DMA. Simple direct/forced
  transmit and receive functions are also available. Note that these functions
  are blocking and not suitable for low energy applications as they use CPU
  polling.

  UART hardware flow control (CTS/RTS) is fully supported by the driver. UART
  software flow control (XON/XOFF) is partially supported by the driver. Read
  more about flow control support in @ref uartdrv_fc.

  @note Transfer completion callback functions are called from within the DMA
  interrupt handler with interrupts disabled.

@n @section uartdrv_conf Configuration Options

  Some properties of the UARTDRV driver are compile-time configurable. These
  properties are set in a file named @ref uartdrv_config.h. A template for this
  file, containing default values, resides in the emdrv/config folder.
  To configure UARTDRV for your application, provide your own configuration file.
  These are the available configuration parameters with default values defined.
  @code

  // Maximum concurrent receive operations
  #define EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS    6

  // Maximum concurrent transmit operations
  #define EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS    6

  // Set to 1 to enable hardware flow control
  #define EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE    1

  // Maximum number of driver instances. This maximum applies only when EMDRV_UARTDRV_HW_FLOW_CONTROL_ENABLE = 1
  #define EMDRV_UARTDRV_MAX_DRIVER_INSTANCES      4

  // UART software flow control code: request peer to start TX
  #define UARTDRV_FC_SW_XON                       0x11

  // UART software flow control code: request peer to stop TX
  #define UARTDRV_FC_SW_XOFF                      0x13
  @endcode

  The properties of each UART driver instance are set at run-time via the
  @ref UARTDRV_InitUart_t data structure input parameter to the @ref UARTDRV_InitUart()
  function for UART and USART peripherals, and the @ref UARTDRV_InitLeuart_t
  data structure input parameter to the @ref UARTDRV_InitLeuart() function for
  LEUART peripherals.

@n @section uartdrv_api The API

  This section contain brief descriptions of the functions in the API. You will
  find detailed information on input and output parameters and return values by
  clicking on the hyperlinked function names. Most functions return an error
  code, @ref ECODE_EMDRV_UARTDRV_OK is returned on success,
  see @ref ecode.h and @ref uartdrv.h for other error codes.

  Your application code must include one header file: @em uartdrv.h.

  @ref UARTDRV_InitUart(), @ref UARTDRV_InitLeuart(), @ref UARTDRV_DeInit() @n
    These functions initialize and deinitialize the UARTDRV driver. Typically
    @htmlonly UARTDRV_InitUart() @endhtmlonly (for UART/USART) or
    @htmlonly UARTDRV_InitLeuart() @endhtmlonly (for LEUART) are called once in
    your startup code.

  @ref UARTDRV_GetReceiveStatus(), @ref UARTDRV_GetTransmitStatus() @n
    Query the status of a current transmit or receive operations. Reports number
    of items (frames) transmitted and remaining.

  @ref UARTDRV_GetReceiveDepth(), @ref UARTDRV_GetTransmitDepth() @n
    Get the number of queued receive or transmit operations.

  @ref UARTDRV_Transmit(), UARTDRV_Receive() @n
  UARTDRV_TransmitB(), UARTDRV_ReceiveB() @n
  UARTDRV_ForceTransmit(), UARTDRV_ForceReceive() @n
    Transfer functions come in both blocking and non-blocking versions,
    the blocking versions have an uppercase B (for Blocking) at the end of
    their function name. Blocking functions will not return before the transfer
    has completed. The non-blocking functions signal transfer completion with a
    callback function. @ref UARTDRV_ForceTransmit() and
    @ref UARTDRV_ForceReceive() are also blocking. These two functions access
    the UART peripheral directly without using DMA or interrupts.
    @ref UARTDRV_ForceTransmit() does not respect flow control.
    @ref UARTDRV_ForceReceive() forces RTS low.

